In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import import_ipynb
from Student_info import country_Student
from Student_info import student_info

importing Jupyter notebook from Student_info.ipynb
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35230 entries, 0 to 35229
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   student_id       35230 non-null  int64
 1   student_country  35217 non-null  object
 2   date_registered  35230 non-null  object
dtypes: int64(1), object(2)
memory usage: 825.8+ KB

In [2]:
student_exams = pd.read_csv('dataSets/365_database/365_student_exams.csv')
student_exams.head()

,exam_attempt_id,student_id,exam_id,exam_result,exam_completion_time,date_exam_completed
0,173311,258803,475,83,5.17,2022-01-01
1,173332,258815,380,0,10.02,2022-01-01
2,173333,258815,380,67,7.93,2022-01-01
3,173335,258815,380,100,0.60,2022-01-01
4,173336,258815,380,0,10.02,2022-01-01

In [4]:
missing_country_df = student_info[student_info.isnull().any(axis=1)]
missing_country = missing_country_df['student_id'].tolist()
print(missing_country)

[261725, 262665, 272144, 278827, 282654, 282914, 283704, 283791, 284550, 284790, 286959, 290648, 293967]

In [7]:
df = student_exams.copy()

df_cleaned = df[~df['student_id'].isin(missing_country)]
student_exam_cleaned = df_cleaned.reset_index(drop=True)
(student_exam_cleaned)

,exam_attempt_id,student_id,exam_id,exam_result,exam_completion_time,date_exam_completed
0,173311,258803,475,83,5.17,2022-01-01
1,173332,258815,380,0,10.02,2022-01-01
2,173333,258815,380,67,7.93,2022-01-01
3,173335,258815,380,100,0.60,2022-01-01
4,173336,258815,380,0,10.02,2022-01-01
...,...,...,...,...,...,...
33967,240399,266321,654,83,2.02,2022-10-20
33968,240401,269110,685,67,2.63,2022-10-20
33969,240405,295234,530,0,16.00,2022-10-20
33970,240406,282935,714,67,4.55,2022-10-20
33971,240407,295256,710,100,23.95,2022-10-20

In [8]:
country = []
i = 0
n = len(student_exam_cleaned)-1

while (i<=n):
    x=student_exam_cleaned['student_id'].loc[i]
    y=country_Student[x]
    country.append(y)
    i=i+1

In [9]:
print(len(country))
df_country = pd.DataFrame(country,columns = ['country'])
df_country

33972

      country
0          US
1          EG
2          EG
3          EG
4          EG
...       ...
33967      LK
33968      CA
33969      US
33970      BR
33971      CA

[33972 rows x 1 columns]

In [10]:
frames = [student_exam_cleaned, df_country]

student_exam_by_country = pd.concat(frames,axis = 1)

student_exam_by_country

# student_exam_by_country['student_id'].value_counts()

# student_exam_by_country['exam_id'].value_counts().sum()

,exam_attempt_id,student_id,exam_id,exam_result,exam_completion_time,date_exam_completed,country
0,173311,258803,475,83,5.17,2022-01-01,US
1,173332,258815,380,0,10.02,2022-01-01,EG
2,173333,258815,380,67,7.93,2022-01-01,EG
3,173335,258815,380,100,0.60,2022-01-01,EG
4,173336,258815,380,0,10.02,2022-01-01,EG
...,...,...,...,...,...,...,...
33967,240399,266321,654,83,2.02,2022-10-20,LK
33968,240401,269110,685,67,2.63,2022-10-20,CA
33969,240405,295234,530,0,16.00,2022-10-20,US
33970,240406,282935,714,67,4.55,2022-10-20,BR
33971,240407,295256,710,100,23.95,2022-10-20,CA